export const DEPARTMENT_ORDER = [
  'ภาควิชาคณิตศาสตร์',
  'ภาควิชาเคมี',
  'ภาควิชาชีววิทยา',
  'ภาควิชาฟิสิกส์',
  'ภาควิชาวิทยาการคอมพิวเตอร์และเทคโนโลยีสารสนเทศ',
];

export const DEPARTMENT_MAJORS = {
  bachelor: {
    'ภาควิชาคณิตศาสตร์': [
      'คณิตศาสตร์',
      'สถิติ',
      'วิทยาการข้อมูลและการวิเคราะห์',
    ],
    'ภาควิชาเคมี': [
      'เคมี',
    ],
    'ภาควิชาชีววิทยา': [
      'ชีววิทยา',
    ],
    'ภาควิชาฟิสิกส์': [
      'ฟิสิกส์',
      'ฟิสิกส์ประยุกต์',
      'เทคโนโลยีนวัตกรรมพลังงานและสิ่งแวดล้อม',
      'เทคโนโลยีการวัดและระบบอัจฉริยะ',
    ],
    'ภาควิชาวิทยาการคอมพิวเตอร์และเทคโนโลยีสารสนเทศ': [
      'วิทยาการคอมพิวเตอร์',
      'เทคโนโลยีสารสนเทศ',
    ],
  },
  master: {
    'ภาควิชาคณิตศาสตร์': [
      'คณิตศาสตร์',
      'สถิติ',
    ],
    'ภาควิชาเคมี': [
      'เคมี',
      'เคมีอุตสาหกรรม'
    ],
    'ภาควิชาชีววิทยา': [
      'เทคโนโลยีชีวภาพ',
      'วิทยาศาสตร์ชีวภาพ',
    ],
    'ภาควิชาฟิสิกส์': [
      'ฟิสิกส์',
      'ฟิสิกส์ประยุกต์',
    ],
    'ภาควิชาวิทยาการคอมพิวเตอร์และเทคโนโลยีสารสนเทศ': [
      'วิทยาการคอมพิวเตอร์',
      'เทคโนโลยีสารสนเทศ',
      'วิทยาการข้อมูลและการเรียนรู้ของเครื่อง',
    ],
  },
  doctoral: {
    'ภาควิชาคณิตศาสตร์': [
      'คณิตศาสตร์',
      'สถิติ',
    ],
    'ภาควิชาเคมี': [
      'เคมี',
    ],
    'ภาควิชาชีววิทยา': [
      'เทคโนโลยีชีวภาพ',
    ],
    'ภาควิชาฟิสิกส์': [
      'ฟิสิกส์',
      'ฟิสิกส์ประยุกต์',
    ],
    'ภาควิชาวิทยาการคอมพิวเตอร์และเทคโนโลยีสารสนเทศ': [
      'วิทยาการคอมพิวเตอร์',
      'เทคโนโลยีสารสนเทศ',

    ],
  },
};

