import { PhInfinity, PhTestTube, PhLeaf, PhAtom, PhCode, PhBriefcase } from '@phosphor-icons/vue';

export const DEPT_CONFIG = [
  { key: 'งานบริการการศึกษา',                                 short: 'งานบริการฯ',                             color: '#3b82f6', icon: PhBriefcase },
  { key: 'ภาควิชาคณิตศาสตร์',                                  short: 'คณิตศาสตร์',                             color: '#ef4444', icon: PhInfinity },
  { key: 'ภาควิชาเคมี',                                        short: 'เคมี',                                   color: '#a855f7', icon: PhTestTube       },
  { key: 'ภาควิชาชีววิทยา',                                     short: 'ชีววิทยา',                               color: '#10b981', icon: PhLeaf           },
  { key: 'ภาควิชาฟิสิกส์',                                     short: 'ฟิสิกส์',                                color: '#3b82f6', icon: PhAtom           },
  { key: 'ภาควิชาวิทยาการคอมพิวเตอร์และเทคโนโลยีสารสนเทศ',     short: 'วิทยาการคอมพิวเตอร์และเทคโนโลยีสารสนเทศ', color: '#f97316', icon: PhCode           },
];

export const getDept = (deptName) =>
  DEPT_CONFIG.find(d => d.key === deptName) ?? null;

export const DEPARTMENT_ORDER = [
  'งานบริการการศึกษา',
  'ภาควิชาคณิตศาสตร์',
  'ภาควิชาเคมี',
  'ภาควิชาชีววิทยา',
  'ภาควิชาฟิสิกส์',
  'ภาควิชาวิทยาการคอมพิวเตอร์และเทคโนโลยีสารสนเทศ',
];

export const DEPARTMENT_MAJORS = {
  bachelor: {
    'ภาควิชาคณิตศาสตร์': [
      'คณิตศาสตร์',
      'สถิติ',
      'วิทยาการข้อมูลและการวิเคราะห์',
    ],
    'ภาควิชาเคมี': [
      'เคมี',
    ],
    'ภาควิชาชีววิทยา': [
      'ชีววิทยา',
    ],
    'ภาควิชาฟิสิกส์': [
      'ฟิสิกส์',
      'ฟิสิกส์ประยุกต์',
      'เทคโนโลยีนวัตกรรมพลังงานและสิ่งแวดล้อม',
      'เทคโนโลยีการวัดและระบบอัจฉริยะ',
    ],
    'ภาควิชาวิทยาการคอมพิวเตอร์และเทคโนโลยีสารสนเทศ': [
      'วิทยาการคอมพิวเตอร์',
      'เทคโนโลยีสารสนเทศ',
    ],
  },
  master: {
    'ภาควิชาคณิตศาสตร์': [
      'คณิตศาสตร์',
      'สถิติ',
    ],
    'ภาควิชาเคมี': [
      'เคมี',
      'เคมีอุตสาหกรรม'
    ],
    'ภาควิชาชีววิทยา': [
      'เทคโนโลยีชีวภาพ',
      'วิทยาศาสตร์ชีวภาพ',
    ],
    'ภาควิชาฟิสิกส์': [
      'ฟิสิกส์',
      'ฟิสิกส์ประยุกต์',
    ],
    'ภาควิชาวิทยาการคอมพิวเตอร์และเทคโนโลยีสารสนเทศ': [
      'วิทยาการคอมพิวเตอร์',
      'เทคโนโลยีสารสนเทศ',
      'วิทยาการข้อมูลและการเรียนรู้ของเครื่อง',
    ],
  },
  doctoral: {
    'ภาควิชาคณิตศาสตร์': [
      'คณิตศาสตร์',
      'สถิติ',
    ],
    'ภาควิชาเคมี': [
      'เคมี',
    ],
    'ภาควิชาชีววิทยา': [
      'เทคโนโลยีชีวภาพ',
    ],
    'ภาควิชาฟิสิกส์': [
      'ฟิสิกส์',
      'ฟิสิกส์ประยุกต์',
    ],
    'ภาควิชาวิทยาการคอมพิวเตอร์และเทคโนโลยีสารสนเทศ': [
      'วิทยาการคอมพิวเตอร์',
      'เทคโนโลยีสารสนเทศ',

    ],
  },
};

